In [1]:
import pandas as pd
visitors = pd.read_csv("visitors.csv")
visitors.head()

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard

In [2]:
visitors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47954 entries, 0 to 47953
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               47954 non-null  object
 1   appt_made_date     47954 non-null  object
 2   appt_start_date    47954 non-null  object
 3   appt_end_date      47954 non-null  object
 4   visitee_namelast   6069 non-null   object
 5   visitee_namefirst  47953 non-null  object
 6   meeting_room       47954 non-null  object
 7   description        8053 non-null   object
dtypes: object(8)
memory usage: 2.9+ MB

In [3]:
pd.to_datetime(visitors["appt_start_date"])

0       2015-01-06 09:30:00
1       2015-01-06 09:30:00
2       2015-01-06 09:30:00
3       2015-01-06 09:30:00
4       2015-01-06 09:30:00
                ...
47949   2015-12-18 16:30:00
47950   2015-12-18 16:30:00
47951   2015-12-18 16:30:00
47952   2015-12-18 16:30:00
47953   2015-12-18 16:30:00
Name: appt_start_date, Length: 47954, dtype: datetime64[ns]

- %d - day in number
- %A - day of the week as word
- %B - Month as word
- %M - minutes

In [4]:
visitors.tail()

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
47949,William B. Henline,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47950,Ian T. Burris,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47951,James F. Albaugh,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47952,Jackie L. Finken,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47953,Grace M. Bauman,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN

In [6]:
date_sample = "12/18/15 16:30"
date_format = "%m/%d/%y %H:%M"
visitors["appt_start_date"] = pd.to_datetime(visitors["appt_start_date"], format = date_format)

In [7]:
visitors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47954 entries, 0 to 47953
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               47954 non-null  object
 1   appt_made_date     47954 non-null  object
 2   appt_start_date    47954 non-null  datetime64[ns]
 3   appt_end_date      47954 non-null  object
 4   visitee_namelast   6069 non-null   object
 5   visitee_namefirst  47953 non-null  object
 6   meeting_room       47954 non-null  object
 7   description        8053 non-null   object
dtypes: datetime64[ns](1), object(7)
memory usage: 2.9+ MB

In [8]:
visitors["appt_end_date"] = pd.to_datetime(visitors["appt_end_date"], format = date_format)

In [9]:
visitors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47954 entries, 0 to 47953
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               47954 non-null  object
 1   appt_made_date     47954 non-null  object
 2   appt_start_date    47954 non-null  datetime64[ns]
 3   appt_end_date      47954 non-null  datetime64[ns]
 4   visitee_namelast   6069 non-null   object
 5   visitee_namefirst  47953 non-null  object
 6   meeting_room       47954 non-null  object
 7   description        8053 non-null   object
dtypes: datetime64[ns](2), object(6)
memory usage: 2.9+ MB

In [10]:
visitors.head()

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard

In [14]:
visitors["appt_start_date"].dt.strftime("%B, %A")

0        January, Tuesday
1        January, Tuesday
2        January, Tuesday
3        January, Tuesday
4        January, Tuesday
               ...
47949    December, Friday
47950    December, Friday
47951    December, Friday
47952    December, Friday
47953    December, Friday
Name: appt_start_date, Length: 47954, dtype: object

In [16]:
visitors["appt_start_date"].dt.strftime("%B-%A")

0        January-Tuesday
1        January-Tuesday
2        January-Tuesday
3        January-Tuesday
4        January-Tuesday
              ...
47949    December-Friday
47950    December-Friday
47951    December-Friday
47952    December-Friday
47953    December-Friday
Name: appt_start_date, Length: 47954, dtype: object

In [17]:
month_wise = visitors["appt_start_date"].dt.strftime("%B %Y")
month_wise

0         January 2015
1         January 2015
2         January 2015
3         January 2015
4         January 2015
             ...
47949    December 2015
47950    December 2015
47951    December 2015
47952    December 2015
47953    December 2015
Name: appt_start_date, Length: 47954, dtype: object

In [18]:
month_wise.value_counts()

December 2015     13029
June 2015          7743
April 2015         4996
September 2015     4416
October 2015       3669
May 2015           3013
July 2015          2930
March 2015         2262
February 2015      2165
August 2015        1350
January 2015       1248
November 2015      1133
Name: appt_start_date, dtype: int64

In [19]:
meeting_length = visitors["appt_end_date"] - visitors["appt_start_date"]
meeting_length

0       0 days 14:29:00
1       0 days 14:29:00
2       0 days 14:29:00
3       0 days 14:29:00
4       0 days 14:29:00
              ...
47949   0 days 07:29:00
47950   0 days 07:29:00
47951   0 days 07:29:00
47952   0 days 07:29:00
47953   0 days 07:29:00
Length: 47954, dtype: timedelta64[ns]

In [20]:
meeting_length.min()

Timedelta('0 days 02:29:00')

In [21]:
meeting_length.max()

Timedelta('16 days 12:59:00')

In [22]:
meeting_length.sum()

Timedelta('21210 days 14:02:00')

In [23]:
show_posts.info()

NameError: name 'show_posts' is not defined